In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
#Install tabula-py library
!pip install tabula-py

Collecting tabula-py
  Downloading https://files.pythonhosted.org/packages/cf/29/d6cb0d77ef46d84d35cffa09cf42c73b373aea664d28604eab6818f8a47c/tabula_py-2.2.0-py3-none-any.whl (11.7MB)
     |████████████████████████████████| 11.7MB 241kB/s
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from tabula-py) (1.19.5)
Requirement already satisfied: pandas>=0.25.3 in /usr/local/lib/python3.7/dist-packages (from tabula-py) (1.1.5)
Collecting distro
  Downloading https://files.pythonhosted.org/packages/25/b7/b3c4270a11414cb22c6352ebc7a83aaa3712043be29daa05018fd5a5c956/distro-1.5.0-py2.py3-none-any.whl
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.25.3->tabula-py) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.25.3->tabula-py) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas>=0.25.3->tabula-py) (1.15.0)
Installing collected packages: distro, tabula-py
Successfully installed distro-1.5.0 tabula-py-2.2.0

In [3]:
#import tabula
import tabula

In [24]:
file = "/content/drive/MyDrive/solar_irradiance_dataset-main.pdf"
table = tabula.read_pdf(file,pages=7,multiple_tables=False)
table[0].head(10)

    Year Month Quarter    Ibadan    Sokoto  Port Harcourt
50  2015   Mar      Q1  175.3990  269.7174       169.0348
51  2015   Apr      Q2  177.2122  293.1761       157.4829
52  2015   May      Q2  178.2418  274.8512       145.4870
53  2015   Jun      Q2  131.3527  256.4359       124.2063
54  2015   Jul      Q3  106.9620  227.5436       101.6585
55  2015   Aug      Q3  105.1376  201.4077       112.5626
56  2015   Sep      Q3  110.3959  218.6873       128.3276
57  2015   Oct      Q4  132.8434  244.4301       156.8578
58  2015   Nov      Q4  152.7041  250.2541       187.9975
59  2015   Dec      Q4  172.3018  209.2145       231.9561

In [25]:
#check output of table
table[0].tail(10)

   Year Month Quarter     Ibadan    Sokoto  Port Harcourt
0  2011   Jan      Q1  152.95440  216.6395       195.3404
1  2011   Feb      Q1  167.18160  221.9066       173.1943
2  2011   Mar      Q1  179.93890  244.9392       180.4480
3  2011   Apr      Q2  162.21800  242.0993       182.9117
4  2011   May      Q2  154.39700  232.1683       160.7612
5  2011   Jun      Q2  126.53000  189.8827       131.3527
6  2011   Jul      Q3   90.88166  168.1862       121.4725
7  2011   Aug      Q3   91.89994  163.3494       114.3021
8  2011   Sep      Q3  112.58800  218.2928       134.7724
9  2011   Oct      Q4  141.07450  231.2348       141.5836

In [28]:
tabula.convert_into(file,"/content/drive/MyDrive/Raw/solar_irradiance.csv",pages=7,output_format="csv")